###  Part # 1
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_catalog_database.database will be created
  + resource "aws_glue_catalog_database" "database" {
      + arn          = (known after apply)
      + catalog_id   = "007774094020"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "terraform-ci-deploy"

      + create_table_default_permission {
          + permissions = (known after apply)

          + principal {
              + data_lake_principal_identifier = (known after apply)
            }
        }
    }

  # aws_glue_crawler.crawler["ingest_json_crawler"] will be created
  + resource "aws_glue_crawler" "crawler" {
      + arn           = (known after apply)
      + database_name = "terraform-ci-deploy"
      + id            = (known after apply)
      + name          = "ingest_json_crawler"
      + role          = (known after apply)
      + tags_all      = (known after apply)

      + s3_target {
          + path = "s3://terraform-ci-deploy/ingest_json_crawler/"
        }
    }

  # aws_glue_crawler.crawler["raw_json_crawler"] will be created
  + resource "aws_glue_crawler" "crawler" {
      + arn           = (known after apply)
      + database_name = "terraform-ci-deploy"
      + id            = (known after apply)
      + name          = "raw_json_crawler"
      + role          = (known after apply)
      + tags_all      = (known after apply)

      + s3_target {
          + path = "s3://terraform-ci-deploy/raw_json_crawler/"
        }
    }

  # aws_glue_job.transform-to-parquet will be created
  + resource "aws_glue_job" "transform-to-parquet" {
      + arn               = (known after apply)
      + glue_version      = "3.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "transform-to-parquet"
      + number_of_workers = 4
      + role_arn          = (known after apply)
      + tags_all          = (known after apply)
      + timeout           = (known after apply)
      + worker_type       = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = (known after apply)
          + script_location = "s3://terraform-ci-deploy/transform-to-parquet.py"
        }

      + execution_property {
          + max_concurrent_runs = (known after apply)
        }

      + notification_property {
          + notify_delay_after = (known after apply)
        }
    }

  # aws_iam_role.crawler-role["ingest_json_crawler"] will be created
  + resource "aws_iam_role" "crawler-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawler-role-ingest_json_crawler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.crawler-role["raw_json_crawler"] will be created
  + resource "aws_iam_role" "crawler-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawler-role-raw_json_crawler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.firehose-role will be created
  + resource "aws_iam_role" "firehose-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "firehose-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.crawler-role-policy["ingest_json_crawler"] will be created
  + resource "aws_iam_role_policy" "crawler-role-policy" {
      + id     = (known after apply)
      + name   = "crawler-role-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "glue:*",
                          + "s3:GetBucketLocation",
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketAcl",
                          + "ec2:DescribeVpcEndpoints",
                          + "ec2:DescribeRouteTables",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcAttribute",
                          + "iam:ListRolePolicies",
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:CreateBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::aws-glue-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::aws-glue-*/*",
                          + "arn:aws:s3:::*/*aws-glue-*/*",
                          + "arn:aws:s3:::terraform-ci-deploy/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::crawler-public*",
                          + "arn:aws:s3:::aws-glue-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:TagKeys" = [
                                  + "aws-glue-service-resource",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:network-interface/*",
                          + "arn:aws:ec2:*:*:security-group/*",
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::terraform-ci-deploy/ingest_json_crawler*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.crawler-role-policy["raw_json_crawler"] will be created
  + resource "aws_iam_role_policy" "crawler-role-policy" {
      + id     = (known after apply)
      + name   = "crawler-role-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "glue:*",
                          + "s3:GetBucketLocation",
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketAcl",
                          + "ec2:DescribeVpcEndpoints",
                          + "ec2:DescribeRouteTables",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcAttribute",
                          + "iam:ListRolePolicies",
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:CreateBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::aws-glue-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::aws-glue-*/*",
                          + "arn:aws:s3:::*/*aws-glue-*/*",
                          + "arn:aws:s3:::terraform-ci-deploy/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::crawler-public*",
                          + "arn:aws:s3:::aws-glue-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:/aws-glue/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:TagKeys" = [
                                  + "aws-glue-service-resource",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:network-interface/*",
                          + "arn:aws:ec2:*:*:security-group/*",
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::terraform-ci-deploy/raw_json_crawler*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.firehose-role-policy will be created
  + resource "aws_iam_role_policy" "firehose-role-policy" {
      + id     = (known after apply)
      + name   = "firehose-role-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "s3-object-lambda:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-ds will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose-ds" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "firehose-ds"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn          = (known after apply)
          + buffer_interval     = 300
          + buffer_size         = 5
          + compression_format  = "UNCOMPRESSED"
          + error_output_prefix = "ingest_json-error/"
          + prefix              = "ingest_json/"
          + role_arn            = (known after apply)
          + s3_backup_mode      = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }
    }

  # aws_s3_bucket.b will be created
  + resource "aws_s3_bucket" "b" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform-ci-deploy"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.b-acl will be created
  + resource "aws_s3_bucket_acl" "b-acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_object.athena-query will be created
  + resource "aws_s3_object" "athena-query" {
      + acl                    = "private"
      + bucket                 = "terraform-ci-deploy"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "athena-query/"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "private"
      + bucket                 = "terraform-ci-deploy"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "transform-to-parquet.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "utilities/transform-to-parquet.py"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_sqs_queue.queue["ingest-csv-queue"] will be created
  + resource "aws_sqs_queue" "queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "ingest-csv-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-west-2:007774094020:ingest-csv-queue-dl"
              + maxReceiveCount     = 50
            }
        )
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.queue["raw-json-queue"] will be created
  + resource "aws_sqs_queue" "queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "raw-json-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-west-2:007774094020:raw-json-queue-dl"
              + maxReceiveCount     = 50
            }
        )
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.queue-dl["ingest-csv-queue"] will be created
  + resource "aws_sqs_queue" "queue-dl" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "ingest-csv-queue-dl"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = jsonencode(
            {
              + redrivePermission = "byQueue"
              + sourceQueueArns   = [
                  + "arn:aws:sqs:us-west-2:007774094020:ingest-csv-queue",
                ]
            }
        )
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.queue-dl["raw-json-queue"] will be created
  + resource "aws_sqs_queue" "queue-dl" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "raw-json-queue-dl"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = jsonencode(
            {
              + redrivePermission = "byQueue"
              + sourceQueueArns   = [
                  + "arn:aws:sqs:us-west-2:007774094020:raw-json-queue",
                ]
            }
        )
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 19 to add, 0 to change, 0 to destroy.

  ```
  </details>
  *Pusher: @codeis4fun, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*